release/jboss-as7/tests/src/test/resources/org/switchyard/test/quickstarts/demo/library/soap-request-5.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV='http://schemas.xmlsoap.org/soap/envelope/'><SOAP-ENV:Header></SOAP-ENV:Header><SOAP-ENV:Body><ns2:loanRequest xmlns:ns2="urn:switchyard-quickstart-demo:library:1.0">
    <isbn>978-0-307-35193-7</isbn>
</ns2:loanRequest></SOAP-ENV:Body></SOAP-ENV:Envelope>
